<template>
	<view>
		<view class="img">
		    <view class="logo"></view>
		</view>
		<view class="about">
		    <view class="title">“湘运行”微信小程序用户协议与隐私政策</view>
		    <view class="article">
		        <view> 湘运行在注册成为用户之前，请认真阅读本《用户协议》(以下简称“协议”)，确保您充分理解本协议中各条款，包括免除湘运行责任的条款及限制用户权利的条款。请您审慎阅读并选择接受或不接受本协议。除非您接受本协议所有条款，否则您无权注册、登录或使用本协议所涉服务。您的注册、登录、使用等行为将视为对本协议的接受，并同意接受本协议各项条款的约束。
		本协议约定湘运行与用户之间关于“湘运行”微信小程序(以下简称“小程序”)服务(以下简称“服务”的权利义务。“用户”是指注册、登录、使用本服务的个人。本协议可由湘运行随时更新修改本协议或各类规则，且毋须另行通知，用户可在小程序中查阅最新版协议条款。在湘运行修改协议条款后，如果用户不接受修改后的条款，请立即停止使用湘运行提供的服务，用户继续使用湘运行提供的服务将被视为接受修改后的协议。</view>
		        <view class="small_title">一、终端安全责任  </view>
		        <view class="small_title1">1、账号须知:</view>
		        <view class="small_title2">您理解并同意，本小程序同大多数互联网网站一样，可能会受多种因素影响，包括但不限于用户操作原因、网络服务质量、社会环境等；也可能会受各种安全问题的侵扰，包括但不限于他人非法利用用户资料，进行现实生活的骚扰；用户下载安装的其他软件或访问的其他网站中可能含有病毒、木马程序或其他恶意程序，威胁您的终端设备信息和数据安全，继而影响本小程序的正常使用等。因此，您应加强信息安全及个人信息的保护意识，注意密码保护，以免遭受损失。</view>
		        <view class="small_title1">2、用户信息:</view>
		        <view class="small_title2">
		因您使用本小程序或要求提供特定服务时，本小程序可能会调用第三方系统或者通过第三方支持用户的使用或访问。使用或访问的结果由该第三方提供，我们不保证第三方提供服务及内容的安全性、准确性、有效性、合法性。由此若引发的任何争议及损害，与者我们无关且我们不承担任何责任。除了本协议的保证以外，我们不向您做任何其他担保。</view>
		        <view class="small_title">二、服务内容</view>
		        <view>1、小程序网络服务的具体内容由小程序根据实际情况提供，例如实用功能、社交消息和信息推送等。<br></br>
		        </view>
		        <view>2、小程序仅提供相关的网络服务，除此之外与相关网络服务有关的设备(如个人电脑、手机、及其他与接入互联网或移动网有关的装置)及所需的费用(如为接入互联网而支付的电话费及上网费、为使用移动网而支付的手机费)均应由用户自行负担。<br></br>
		        </view>
		        <view>3、小程序系统接入学校系统，如：教务系统，提供课程查询、成绩查询、学分统计等实用服务，在您注册使用之前，可能会提示需要提供湖教务系统和其他系统账号、密码等信息。您输入账号、密码后即同意授权并委托保存到服务器上，我们以您的名义接入教务和其他系统并将查询的结果返回给您，未经您的允许，我们不会保存查询结果，或向其他第三方组织或个人泄露。在等级查询相关功能中，我们会提示您输入准考证号，在您输入后即视为同意授权并委托我们以您的名义查询信息，我们将通过相关等级考试官方查询渠道的方式为您获取成绩等信息。对于在上述过程中所获悉的用户个人的课程、成绩等信息我们不会保存在服务器上，用户代保管的账号、密码我们不会以任何形式向其他第三方组织或个人泄露。<br></br>
		        </view>
		        <view class="small_title">三、隐私保护</view>
		        <view>
		1、用户在注册账号或使用本服务的过程中，可能需要填写或提交一些必要的信息，如法律法规、规章规范性文件(以下称“法律法规”)规定的需要填写的身份信息。如用户提交的信息不完整或不符合法律法规的规定，则用户可能无法使用本服务或在使用本服务的过程中受到限制。<br></br>
		        </view>
		        <view>2、个人隐私信息是指涉及用户个人身份或个人隐私的信息，比如，用户真实姓名、身份证号、手机号码、手机设备识别码、IP地址。非个人隐私信息是指用户对本服务的操作状态以及使用习惯等明确且客观反映在湘运行服务器端的基本记录信息、个人隐私信息范围外的其它普通信息，以及用户同意公开的上述隐私信息。<br></br>
		        </view>
		        <view>3、尊重用户个人隐私信息的私有性是湘运行的一贯制度，湘运行将采取技术措施和其他必要措施，确保用户个人隐私信息安全，防止在本服务中收集的用户个人隐私信息泄露、毁损或丢失。在发生前述情形或者湘运行发现存在发生前述情形的可能时，将及时采取补救措施。<br></br>
		        </view>
		        <view>4、湘运行小程序仅提供使用开放接口的技术服务，不对开发者和用户行为的合法性、有效性及应用的真实性、合法性和有效性作任何明示和默示的担保。<br></br>
		        </view>
		        <view>5、湘运行未经用户同意不向任何第三方公开、透露用户个人隐私信息。但以下特定情形除外:<br></br>
		湘运行根据法律法规规定或有权机关的指示提供用户的个人隐私信息;
		由于用户将其用户密码告知他人或与他人共享注册帐户与密码，由此导致的任何个人信息的泄漏，或其他非因湘运行原因导致的个人隐私信息的泄露;
		用户自行向第三方公开其个人隐私信息;
		用户与湘运行及合作单位之间就用户个人隐私信息的使用公开达成约定，湘运行因此向合作单位公开用户个人隐私信息;
		任何由于黑客攻击、电脑病毒侵入及其他不可抗力事件导致用户个人隐私信息的泄露。
		</view>
		        <view>6、用户同意湘运行可在以下事项中使用用户的个人信息:<br></br>
		湘运行向用户及时发送重要通知，如软件更新等;
		湘运行内部进行审计、数据分析和研究等，以进行相关总结活动，改进湘运行的产品、服务和与用户之间的沟通;
		依本协议约定，湘运行管理、审查用户信息及进行处理措施;适用法律法规规定的其他事项。
		为了改善湘运行的技术和服务，向用户提供更好的服务体验，湘运行或可会自行收集或向已通过认证的小程序授权用户的基本信息。
		除上述事项外，如未取得用户事先同意，湘运行不会将用户个人隐私信息使用于任何其他用途。
		</view>
		        <view>7、如发生下述任一情况而导致服务中断及用户损失的，湘运行不承担责任：<br></br>
		发生不可抗力的事件或情况。
		任何因第三方原因导致传输数据中断或发现改变。例如网络通信故障、政府管制、黑客攻击、计算机病毒等。
		存在系统bug、硬件故障、停止运营等自身原因。</view>
		        <view class="small_title">四、知识产权</view>
		        <view>
		小程序内包括但不限于著作、图片、档案、资讯、资料、网站架构、网站画面的安排、网页设计，代码等均由小程序开发者拥有其知识产权，包括但不限于商标权、专利权、著作权等。非经小程序开发者书面同意，任何人不得擅自使用、修改、复制、公开传播、改变、散布、发行或公开发表平台提供的代码或内容。</view>
		    </view>
		</view>
		<view style="height:10vh; background-color: #fff;"></view>
		<view id="footer" style="bottom:0%;margin:0 auto;width:100%;left:0; background-color: #fff;">
		    <view class="copyright" style="font-size:12px;line-height:24px;color:#919797;text-align:center;margin:0 auto;">
				© 湘运行
			</view>
<!-- 		    <view class="copyright" style="font-size:12px;line-height:24px;color:#919797;text-align:center;margin:0 auto;">
				All Rights Reserved.
			</view> -->
		</view>

	</view>
</template>

<script>
	export default {
		data() {
			return {
				
			}
		},
		methods: {
			
		}
	}
</script>

<style>
@import './agreement.css';
</style>
